In [3]:
import pandas as pd
import numpy as np

In [4]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df = pd.read_csv(url, sep='\s+', header=None) #get the data of url, separator is any whitespace
#header = None means there's no column name

In [5]:
df.head(n=2)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.9,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.9,9.14,21.6

In [6]:
df.columns = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAbT', 'MEDV']
#setting column name

In [7]:
df.head(n=2)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAbT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.9,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.9,9.14,21.6

In [8]:
df.as_matrix #or df.values
#converting df to matrix

<bound method NDFrame.as_matrix of          CRIM    ZN  INDUS  CHAS    NOX     RM    AGE     DIS  RAD    TAX  \
0     0.00632  18.0   2.31     0  0.538  6.575   65.2  4.0900    1  296.0
1     0.02731   0.0   7.07     0  0.469  6.421   78.9  4.9671    2  242.0
2     0.02729   0.0   7.07     0  0.469  7.185   61.1  4.9671    2  242.0
3     0.03237   0.0   2.18     0  0.458  6.998   45.8  6.0622    3  222.0
4     0.06905   0.0   2.18     0  0.458  7.147   54.2  6.0622    3  222.0
5     0.02985   0.0   2.18     0  0.458  6.430   58.7  6.0622    3  222.0
6     0.08829  12.5   7.87     0  0.524  6.012   66.6  5.5605    5  311.0
7     0.14455  12.5   7.87     0  0.524  6.172   96.1  5.9505    5  311.0
8     0.21124  12.5   7.87     0  0.524  5.631  100.0  6.0821    5  311.0
9     0.17004  12.5   7.87     0  0.524  6.004   85.9  6.5921    5  311.0
10    0.22489  12.5   7.87     0  0.524  6.377   94.3  6.3467    5  311.0
11    0.11747  12.5   7.87     0  0.524  6.009   82.9  6.2267    5  311.0
12    0.09378  12.5   7.87     0  0.524  5.889   39.0  5.4509    5  311.0
13    0.62976   0.0   8.14     0  0.538  5.949   61.8  4.7075    4  307.0
14    0.63796   0.0   8.14     0  0.538  6.096   84.5  4.4619    4  307.0
15    0.62739   0.0   8.14     0  0.538  5.834   56.5  4.4986    4  307.0
16    1.05393   0.0   8.14     0  0.538  5.935   29.3  4.4986    4  307.0
17    0.78420   0.0   8.14     0  0.538  5.990   81.7  4.2579    4  307.0
18    0.80271   0.0   8.14     0  0.538  5.456   36.6  3.7965    4  307.0
19    0.72580   0.0   8.14     0  0.538  5.727   69.5  3.7965    4  307.0
20    1.25179   0.0   8.14     0  0.538  5.570   98.1  3.7979    4  307.0
21    0.85204   0.0   8.14     0  0.538  5.965   89.2  4.0123    4  307.0
22    1.23247   0.0   8.14     0  0.538  6.142   91.7  3.9769    4  307.0
23    0.98843   0.0   8.14     0  0.538  5.813  100.0  4.0952    4  307.0
24    0.75026   0.0   8.14     0  0.538  5.924   94.1  4.3996    4  307.0
25    0.84054   0.0   8.14     0  0.538  5.599   85.7  4.4546    4  307.0
26    0.67191   0.0   8.14     0  0.538  5.813   90.3  4.6820    4  307.0
27    0.95577   0.0   8.14     0  0.538  6.047   88.8  4.4534    4  307.0
28    0.77299   0.0   8.14     0  0.538  6.495   94.4  4.4547    4  307.0
29    1.00245   0.0   8.14     0  0.538  6.674   87.3  4.2390    4  307.0
..        ...   ...    ...   ...    ...    ...    ...     ...  ...    ...
476   4.87141   0.0  18.10     0  0.614  6.484   93.6  2.3053   24  666.0
477  15.02340   0.0  18.10     0  0.614  5.304   97.3  2.1007   24  666.0
478  10.23300   0.0  18.10     0  0.614  6.185   96.7  2.1705   24  666.0
479  14.33370   0.0  18.10     0  0.614  6.229   88.0  1.9512   24  666.0
480   5.82401   0.0  18.10     0  0.532  6.242   64.7  3.4242   24  666.0
481   5.70818   0.0  18.10     0  0.532  6.750   74.9  3.3317   24  666.0
482   5.73116   0.0  18.10     0  0.532  7.061   77.0  3.4106   24  666.0
483   2.81838   0.0  18.10     0  0.532  5.762   40.3  4.0983   24  666.0
484   2.37857   0.0  18.10     0  0.583  5.871   41.9  3.7240   24  666.0
485   3.67367   0.0  18.10     0  0.583  6.312   51.9  3.9917   24  666.0
486   5.69175   0.0  18.10     0  0.583  6.114   79.8  3.5459   24  666.0
487   4.83567   0.0  18.10     0  0.583  5.905   53.2  3.1523   24  666.0
488   0.15086   0.0  27.74     0  0.609  5.454   92.7  1.8209    4  711.0
489   0.18337   0.0  27.74     0  0.609  5.414   98.3  1.7554    4  711.0
490   0.20746   0.0  27.74     0  0.609  5.093   98.0  1.8226    4  711.0
491   0.10574   0.0  27.74     0  0.609  5.983   98.8  1.8681    4  711.0
492   0.11132   0.0  27.74     0  0.609  5.983   83.5  2.1099    4  711.0
493   0.17331   0.0   9.69     0  0.585  5.707   54.0  2.3817    6  391.0
494   0.27957   0.0   9.69     0  0.585  5.926   42.6  2.3817    6  391.0
495   0.17899   0.0   9.69     0  0.585  5.670   28.8  2.7986    6  391.0
496   0.28960   0.0   9.69     0  0.585  5.390   72.9  2.7986    6  391.0
497   0.26838   0.0   9.69     0  0.585  5.794   70.6  2.8927    6  391.0
498   0.23912   0.0   9.69     0  0.585  6.019   65.3  2.4091    6  391.0
499   0.17783   0.0   9.69     0  0.585  5.569   73.5  2.3999    6  391.0
500   0.22438   0.0   9.69     0  0.585  6.027   79.7  2.4982    6  391.0
501   0.06263   0.0  11.93     0  0.573  6.593   69.1  2.4786    1  273.0
502   0.04527   0.0  11.93     0  0.573  6.120   76.7  2.2875    1  273.0
503   0.06076   0.0  11.93     0  0.573  6.976   91.0  2.1675    1  273.0
504   0.10959   0.0  11.93     0  0.573  6.794   89.3  2.3889    1  273.0
505   0.04741   0.0  11.93     0  0.573  6.030   80.8  2.5050    1  273.0

     PTRATIO       B  LSTAbT  MEDV
0       15.3  396.90    4.98  24.0
1       17.8  396.90    9.14  21.6
2       17.8  392.83    4.03  34.7
3       18.7  394.63    2.94  33.4
4       18.7  396.90    5.33  36.2
5       18.7  394.12    5.21  28.7
6       15.2  395.60   12.43  22.9
7       15.2  396.90   19.15  27.1
8       15.2  386.63   29.93  16.5
9       15.2  386.71   17.10  18.9
10      15.2  392.52   20.45  15.0
11      15.2  396.90   13.27  18.9
12      15.2  390.50   15.71  21.7
13      21.0  396.90    8.26  20.4
14      21.0  380.02   10.26  18.2
15      21.0  395.62    8.47  19.9
16      21.0  386.85    6.58  23.1
17      21.0  386.75   14.67  17.5
18      21.0  288.99   11.69  20.2
19      21.0  390.95   11.28  18.2
20      21.0  376.57   21.02  13.6
21      21.0  392.53   13.83  19.6
22      21.0  396.90   18.72  15.2
23      21.0  394.54   19.88  14.5
24      21.0  394.33   16.30  15.6
25      21.0  303.42   16.51  13.9
26      21.0  376.88   14.81  16.6
27      21.0  306.38   17.28  14.8
28      21.0  387.94   12.80  18.4
29      21.0  380.23   11.98  21.0
..       ...     ...     ...   ...
476     20.2  396.21   18.68  16.7
477     20.2  349.48   24.91  12.0
478     20.2  379.70   18.03  14.6
479     20.2  383.32   13.11  21.4
480     20.2  396.90   10.74  23.0
481     20.2  393.07    7.74  23.7
482     20.2  395.28    7.01  25.0
483     20.2  392.92   10.42  21.8
484     20.2  370.73   13.34  20.6
485     20.2  388.62   10.58  21.2
486     20.2  392.68   14.98  19.1
487     20.2  388.22   11.45  20.6
488     20.1  395.09   18.06  15.2
489     20.1  344.05   23.97   7.0
490     20.1  318.43   29.68   8.1
491     20.1  390.11   18.07  13.6
492     20.1  396.90   13.35  20.1
493     19.2  396.90   12.01  21.8
494     19.2  396.90   13.59  24.5
495     19.2  393.29   17.60  23.1
496     19.2  396.90   21.14  19.7
497     19.2  396.90   14.10  18.3
498     19.2  396.90   12.92  21.2
499     19.2  395.77   15.10  17.5
500     19.2  396.90   14.33  16.8
501     21.0  391.99    9.67  22.4
502     21.0  396.90    9.08  20.6
503     21.0  396.90    5.64  23.9
504     21.0  393.45    6.48  22.0
505     21.0  396.90    7.88  11.9

[506 rows x 14 columns]>

## Basic Structure

In [9]:
type(df) #a set of Series

pandas.core.frame.DataFrame

In [10]:
type(df['B']) #Series is a column
#so a dataFrame is made of Series

pandas.core.series.Series

# Series

In [11]:
#Series is a subclass of numpy.ndarray
#Series is a column

list_data = [1,2,3,4,5]
series = pd.Series(list_data) #make Series based on a list
print(series, type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64 <class 'pandas.core.series.Series'>

In [12]:
iSeries = pd.Series(list_data, ['a', 'b', 'c', 'd', 'e'])
#setting index for rows of Series
iSeries['a'] = 10 #using index to access element
print(iSeries)

#Dict to Series
dSeries = pd.Series({'a':1, 'b':2}, dtype=np.float32)
print(dSeries)

a    10
b     2
c     3
d     4
e     5
dtype: int64
a    1.0
b    2.0
dtype: float32

# DataFrame

In [13]:
testScore = pd.DataFrame({'Name' : ['형곤', '성민', '세훈', '수빈', '주헌'],
                       'Math' : ['A+', 'A', 'B+', 'B', 'C+'],
                       'COMP' : ['C+', 'C', 'B', 'B+', 'A+']
}) #creating a dataFrame with dictionary

In [14]:
testScore

  Name Math COMP
0   형곤   A+   C+
1   성민    A    C
2   세훈   B+    B
3   수빈    B   B+
4   주헌   C+   A+

In [15]:
pd.DataFrame(testScore, columns = ['Name', 'COMP']) #extracting columns

  Name COMP
0   형곤   C+
1   성민    C
2   세훈    B
3   수빈   B+
4   주헌   A+

In [16]:
pd.DataFrame(testScore, columns = testScore.columns.append(pd.Index(['is형곤']))) #adding a column

  Name Math COMP  is형곤
0   형곤   A+   C+   NaN
1   성민    A    C   NaN
2   세훈   B+    B   NaN
3   수빈    B   B+   NaN
4   주헌   C+   A+   NaN

In [17]:
print(testScore.Name) # accessing a column (method 1)

0    형곤
1    성민
2    세훈
3    수빈
4    주헌
Name: Name, dtype: object

In [18]:
print(testScore['Name']) #accessing a column (method 2)

0    형곤
1    성민
2    세훈
3    수빈
4    주헌
Name: Name, dtype: object

# Rows

In [19]:
df2 = pd.DataFrame(testScore, index = [4,3,2,1,0])
df2

  Name Math COMP
4   주헌   C+   A+
3   수빈    B   B+
2   세훈   B+    B
1   성민    A    C
0   형곤   A+   C+

In [20]:
df2.loc[0] # by index name

Name    형곤
Math    A+
COMP    C+
Name: 0, dtype: object

In [21]:
df2.iloc[0] # by index position

Name    주헌
Math    C+
COMP    A+
Name: 4, dtype: object

In [22]:
#creating a new column based on current columns
df2 = pd.DataFrame(testScore, columns = testScore.columns.append(pd.Index(['is형곤']))) #adding a column
df2.is형곤 = df2.Name == '형곤'
df2

  Name Math COMP   is형곤
0   형곤   A+   C+   True
1   성민    A    C  False
2   세훈   B+    B  False
3   수빈    B   B+  False
4   주헌   C+   A+  False

In [23]:
df2.T #transpose (function of numpy)

         0      1      2      3      4
Name    형곤     성민     세훈     수빈     주헌
Math    A+      A     B+      B     C+
COMP    C+      C      B     B+     A+
is형곤  True  False  False  False  False

In [24]:
#convert to ndarray
df2.values
type(df2.values)

numpy.ndarray

In [25]:
#convert to comma separated value
df2.to_csv()

',Name,Math,COMP,is형곤\n0,형곤,A+,C+,True\n1,성민,A,C,False\n2,세훈,B+,B,False\n3,수빈,B,B+,False\n4,주헌,C+,A+,False\n'

In [26]:
del df2['is형곤']
df2

  Name Math COMP
0   형곤   A+   C+
1   성민    A    C
2   세훈   B+    B
3   수빈    B   B+
4   주헌   C+   A+

# Selection & Drop

In [27]:
#selecting with column name(s)
df2['Name'].head() #Series
df2[['Name', 'COMP']].head() #DataFrame

  Name COMP
0   형곤   C+
1   성민    C
2   세훈    B
3   수빈   B+
4   주헌   A+

In [28]:
df2[:3] #if you put a number in bracket, that returns row(s)

  Name Math COMP
0   형곤   A+   C+
1   성민    A    C
2   세훈   B+    B

### Series Selection

In [29]:
names = df2['Name']
names[names != '형곤']

1    성민
2    세훈
3    수빈
4    주헌
Name: Name, dtype: object

In [30]:
names[[0,1,4]]

0    형곤
1    성민
4    주헌
Name: Name, dtype: object

In [31]:
testScore.index = testScore['Name']
testScore.head(3)

     Name Math COMP
Name
형곤     형곤   A+   C+
성민     성민    A    C
세훈     세훈   B+    B

In [32]:
del testScore['Name']
testScore.head(3)

     Math COMP
Name
형곤     A+   C+
성민      A    C
세훈     B+    B

In [33]:
testScore.loc['형곤']

Math    A+
COMP    C+
Name: 형곤, dtype: object

#### Basic, loc, iloc selection

In [34]:
testScore = pd.DataFrame({'Name' : ['형곤', '성민', '세훈', '수빈', '주헌'],
                       'Math' : ['A+', 'A', 'B+', 'B', 'C+'],
                       'COMP' : ['C+', 'C', 'B', 'B+', 'A+']
})

print(testScore[['Name', 'Math']][:2]) #columns first, rows second
print(testScore.loc[[0, 1], ['Name', 'Math']]) #rows first, columns second
print(testScore.iloc[:2, :2])

  Name Math
0   형곤   A+
1   성민    A
  Name Math
0   형곤   A+
1   성민    A
  Name Math
0   형곤   A+
1   성민    A

In [35]:
testScore.index = reversed(range(testScore.shape[0])) #resetting index

In [36]:
testScore

  Name Math COMP
4   형곤   A+   C+
3   성민    A    C
2   세훈   B+    B
1   수빈    B   B+
0   주헌   C+   A+

In [37]:
testScore.drop(0) #index name (similar to dataFrame.loc)
#droppping a row (does not affect original dataFrame)

  Name Math COMP
4   형곤   A+   C+
3   성민    A    C
2   세훈   B+    B
1   수빈    B   B+

In [38]:
testScore # not affected

  Name Math COMP
4   형곤   A+   C+
3   성민    A    C
2   세훈   B+    B
1   수빈    B   B+
0   주헌   C+   A+

In [39]:
testScore.drop(0, inplace=True)
testScore #Use this code if you want to drop a row forever

  Name Math COMP
4   형곤   A+   C+
3   성민    A    C
2   세훈   B+    B
1   수빈    B   B+

In [40]:
testScore.drop('Math', axis=1) #dropping a column
#same code : del['Math']

  Name COMP
4   형곤   C+
3   성민    C
2   세훈    B
1   수빈   B+

### Series Operation

In [41]:
score1 = pd.Series([1,2,3,4,5], index=['형곤', '주헌', '세훈', '수빈', '성민'])
score2 = pd.Series([1,2,3,4,5], index=['성민', '수빈', '세훈', '주헌', '형곤'])
print(score1)
print(score2)
print(score1 + score2) #add based on index name (value)

형곤    1
주헌    2
세훈    3
수빈    4
성민    5
dtype: int64
성민    1
수빈    2
세훈    3
주헌    4
형곤    5
dtype: int64
성민    6
세훈    6
수빈    6
주헌    6
형곤    6
dtype: int64

### dataFrame Operation

In [42]:
df1 = pd.DataFrame([[1,2,3,4],[1,2,3,4],[1,2,3,4],[1,2,3,4]], [1,2,3,4])
df1

   0  1  2  3
1  1  2  3  4
2  1  2  3  4
3  1  2  3  4
4  1  2  3  4

In [43]:
df2 = pd.DataFrame([[5,6,7,8],[5,6,7,8],[5,6,7,8]], [1,2,3])
df2

   0  1  2  3
1  5  6  7  8
2  5  6  7  8
3  5  6  7  8

In [44]:
df1+df2

     0    1     2     3
1  6.0  8.0  10.0  12.0
2  6.0  8.0  10.0  12.0
3  6.0  8.0  10.0  12.0
4  NaN  NaN   NaN   NaN

In [45]:
df1.add(df2, fill_value=0) #if a column does not exist on one dataFrame, then set them to zeros

     0    1     2     3
1  6.0  8.0  10.0  12.0
2  6.0  8.0  10.0  12.0
3  6.0  8.0  10.0  12.0
4  1.0  2.0   3.0   4.0

### Series + dataFrame

In [46]:
s1 = pd.Series([1,2,3,4], [0,1,2,3])
print(df1)
print(s1)
s1 + df1 #broadcasting based on columns.

   0  1  2  3
1  1  2  3  4
2  1  2  3  4
3  1  2  3  4
4  1  2  3  4
0    1
1    2
2    3
3    4
dtype: int64

   0  1  2  3
1  2  4  6  8
2  2  4  6  8
3  2  4  6  8
4  2  4  6  8

In [47]:
df1.add(s1, axis=0) #broadcasting based on rows

     0    1    2    3
0  NaN  NaN  NaN  NaN
1  3.0  4.0  5.0  6.0
2  4.0  5.0  6.0  7.0
3  5.0  6.0  7.0  8.0
4  NaN  NaN  NaN  NaN

## Lambda

In [48]:
power = pd.Series(range(2,11))
power.map(lambda x: x**2)

0      4
1      9
2     16
3     25
4     36
5     49
6     64
7     81
8    100
dtype: int64

## Map

In [49]:
s1 = pd.Series(range(5))
s2 = pd.Series(range(10, 15), range(5))
s1.map(s2) #map with Series

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [50]:
table = {0 : 10, 1 : 11, 2 : 12, 3 : 13, 4 : 14}
s1.map(table) #map with dictionary

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [51]:
s1.replace({0:10, 1:11, 2:12, 3:13, 4:14})

0    10
1    11
2    12
3    13
4    14
dtype: int64

## Apply

In [100]:
#map : do something on one Series
#apply : do something on all of Series

from random import randint

heights = pd.DataFrame([[randint(150, 190) for i in range(20)], [randint(150, 190) for i in range(20)], [randint(150, 190) for i in range(20)]], ['1반', '2반', '3반'])
heights = heights.T
heights.apply(lambda x: sum(x)/len(x))

1반    169.90
2반    168.90
3반    169.35
dtype: float64

In [109]:
def f(x):
    return pd.Series([x.min(), x.max(), sum(x)/len(x)], index=['Min', 'Max', 'Mean'])
heights.apply(f)

         1반     2반      3반
Min   150.0  150.0  153.00
Max   190.0  190.0  190.00
Mean  169.9  168.9  169.35

In [112]:
heights.applymap(lambda x: -x).head(2) #applying on all elements of all Series

    1반   2반   3반
0 -154 -156 -188
1 -152 -178 -164

## Pandas Built-in functions

In [115]:
heights.describe() # shows statistical information

               1반          2반          3반
count   20.000000   20.000000   20.000000
mean   169.900000  168.900000  169.350000
std     13.412092   13.274035   12.633602
min    150.000000  150.000000  153.000000
25%    159.500000  156.750000  156.000000
50%    166.500000  166.500000  168.500000
75%    185.250000  181.500000  178.500000
max    190.000000  190.000000  190.000000

## Label code

In [128]:
dict(enumerate(heights['1반']))

{0: 154,
 1: 152,
 2: 174,
 3: 186,
 4: 164,
 5: 186,
 6: 165,
 7: 160,
 8: 158,
 9: 166,
 10: 167,
 11: 185,
 12: 175,
 13: 154,
 14: 165,
 15: 150,
 16: 188,
 17: 188,
 18: 190,
 19: 171}

In [126]:
dict(zip(heights['1반'].unique(), [i for i in range(len(heights['1반'].unique()))]))

{154: 0,
 152: 1,
 174: 2,
 186: 3,
 164: 4,
 165: 5,
 160: 6,
 158: 7,
 166: 8,
 167: 9,
 185: 10,
 175: 11,
 150: 12,
 188: 13,
 190: 14,
 171: 15}